.planning/case_profiles/case_029_naca_stall_dicts/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| case_029 NACA 0012 stall · simpleFoam · α=10° default (overridden per case_aoa_*)
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         5000;
deltaT          1;
writeControl    timeStep;
writeInterval   500;
purgeWrite      2;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

functions
{
    forceCoeffs1
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   50;
        log             true;
        patches         (naca0012);
        rho             rhoInf;
        rhoInf          1.225;
        liftDir         (-0.17365 0.98481 0);  // α=10°: (-sin10, cos10, 0)
        dragDir         ( 0.98481 0.17365 0);  // α=10°: ( cos10, sin10, 0)
        CofR            (0.25 0 0);
        pitchAxis       (0 0 1);
        magUInf         45;
        lRef            1.0;
        Aref            0.1;
    }

    yPlus1
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
    }

    residuals1
    {
        type            solverInfo;
        libs            (utilityFunctionObjects);
        fields          (U p k omega);
        writeControl    timeStep;
        writeInterval   1;
    }
}

// ************************************************************************* //
