.planning/case_profiles/case_029_naca_stall_dicts/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | case_029 NACA 0012 stall · 30c × 20c slab        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-10 -10 -0.05)   // 0
    ( 20 -10 -0.05)   // 1
    ( 20  10 -0.05)   // 2
    (-10  10 -0.05)   // 3
    (-10 -10  0.05)   // 4
    ( 20 -10  0.05)   // 5
    ( 20  10  0.05)   // 6
    (-10  10  0.05)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 4 7 3));
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }
    bottom
    {
        type patch;
        faces ((0 1 5 4));
    }
    top
    {
        type patch;
        faces ((3 7 6 2));
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
