.planning/case_profiles/case_029_naca_stall_dicts/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| case_029 NACA 0012 stall · sHM tuned for y+ ~ 1-3 (achievable on slab mesh)    |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    naca0012.stl
    {
        type triSurfaceMesh;
        name naca0012;
    }
    refineBox
    {
        type   box;
        min ( -2 -2 -1);
        max (  4  2  1);
    }
}

castellatedMeshControls
{
    maxLocalCells      4000000;
    maxGlobalCells     8000000;
    minRefinementCells 10;
    nCellsBetweenLevels 3;
    maxLoadUnbalance   0.10;
    resolveFeatureAngle 30;
    allowFreeStandingZoneFaces false;

    features
    (
        { file "naca0012.eMesh"; level 5; }
    );

    refinementSurfaces
    {
        naca0012
        {
            level (4 5);
            patchInfo { type wall; }
        }
    }

    refinementRegions
    {
        refineBox
        {
            mode inside;
            levels ((1E15 2));
        }
    }

    locationInMesh (-5 0 0);
}

snapControls
{
    nSmoothPatch       3;
    tolerance          2.0;
    nSolveIter         50;
    nRelaxIter         8;
    nFeatureSnapIter   10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes        false;
    firstLayerThickness  1e-5;
    expansionRatio       1.25;
    minThickness         1e-7;

    layers
    {
        naca0012
        {
            nSurfaceLayers 10;
        }
    }

    nGrow                       0;
    featureAngle                170;
    slipFeatureAngle            30;
    nRelaxIter                  5;
    nSmoothSurfaceNormals       1;
    nSmoothNormals              3;
    nSmoothThickness            10;
    maxFaceThicknessRatio       0.5;
    maxThicknessToMedialRatio   0.3;
    minMedialAxisAngle          90;
    nBufferCellsNoExtrude       0;
    nLayerIter                  50;
    nRelaxedIter                20;
}

meshQualityControls
{
    maxNonOrtho     70;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave      80;
    minVol          1e-13;
    minTetQuality   -1e30;
    minArea         -1;
    minTwist        0.02;
    minDeterminant  0.001;
    minFaceWeight   0.05;
    minVolRatio     0.01;
    minTriangleTwist -1;
    nSmoothScale    4;
    errorReduction  0.75;
    relaxed { maxNonOrtho 75; }
}

writeFlags
(
);

mergeTolerance 1e-6;

// ************************************************************************* //
