.planning/case_profiles/case_029_naca_stall_dicts/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| case_029 NACA 0012 stall · kOmegaSST RAS                                       |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  RAS;

RAS
{
    RASModel        kOmegaSST;
    turbulence      on;
    printCoeffs     on;
}

// ************************************************************************* //
