.planning/case_profiles/case_029_naca_stall_dicts/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| case_029 NACA 0012 stall · air at 15°C standard                               |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel  Newtonian;
nu              1.5e-05;   // m²/s, air at 15°C standard

// ************************************************************************* //
