.planning/case_profiles/case_029_naca_stall_dicts/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| case_029 NACA 0012 · α=10° default · |U|=45 m/s · Re_c=3e6                    |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (44.32 7.81 0);

boundaryField
{
    inlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (44.32 7.81 0);
    }
    outlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (44.32 7.81 0);
    }
    top
    {
        type            freestreamVelocity;
        freestreamValue uniform (44.32 7.81 0);
    }
    bottom
    {
        type            freestreamVelocity;
        freestreamValue uniform (44.32 7.81 0);
    }
    naca0012
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
