.planning/case_profiles/case_029_naca_stall_dicts/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| case_029 NACA 0012 · kinematic pressure                                       |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }
    outlet
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }
    top
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }
    bottom
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }
    naca0012
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
