.planning/case_profiles/case_029_naca_stall_dicts/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| case_029 NACA 0012 stall · SIMPLE consistent · low-Re kOmegaSST RAS           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }

    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
        nSweeps         2;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent               yes;

    residualControl
    {
        p       1e-5;
        U       1e-5;
        "(k|omega)" 1e-5;
    }
}

relaxationFactors
{
    fields  { p 0.7; }
    equations
    {
        U       0.7;
        "(k|omega)" 0.7;
    }
}

// ************************************************************************* //
